src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>НаменованиеПоставщика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СчетНаОплату/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		НаменованиеПоставщика = ДанныеЗаполнения.НаменованиеПоставщика;
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения.Ссылка;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
